Documents/ОбъединениеГМВТЕ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбъединениеГМВТЕ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставкиКлиенту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаОбъединения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияОбъединения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаШтрихкода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объединено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъединений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТранспортнаяЕдиница</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыОбъединенияГМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаДоставку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданиеНаДоставку</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаДоставке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленыДанныеИзДругогоЗаданияНаДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКорректировкиГрузомест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссДокинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказаВУТ11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерWMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ОбъединениеГМВТЕ</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоставкаПоказная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОчередьДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОчередьДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОбъединениеГМВТЕ/Ext/ManagerModule.bsl
Процедура Печать(Объединение, СразуНаПринтер = Истина, Принтер = "") Экспорт

	Если НЕ Объединение.Проведен Тогда
		
		Сообщить("Документ Объединение ГМ в ТЕ не проведен !");
		Возврат;  
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объединение.Грузополучатель) Тогда   
		ГрузополучательПечать = Объединение.Контрагент;        
	Иначе                                           
		ГрузополучательПечать = Объединение.Грузополучатель;  
	КонецЕсли;          
	
	КодМаршрута = 0;
	
	Если Не ЗначениеЗаполнено(ГрузополучательПечать.МаршрутДоставки) ТОгда 
		МаршрутДоставки = "";          
	Иначе                           
		КодМаршрута = ГрузополучательПечать.МаршрутДоставки.Код; 
	КонецЕсли;
			
	ДокументШтрихКода = Объединение;
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	Макет  = ПолучитьМакет("Объединение"); 
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.КодМаршрута	= ?(Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз, "", Число(КодМаршрута));
	ОбластьМакета.Параметры.Номер  = Объединение.Номер;
	ОбластьМакета.Параметры.Дата   = Формат(Объединение.Дата, "ДЛФ=D");
	
	ОбластьМакета.Параметры.Клиент = СокрЛП(ГрузополучательПечать);
	ОбластьМакета.Параметры.ДатаДоставки = Объединение.ДатаДоставкиКлиенту;
	
	Если Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
		ПечСпособДоставки = "Самовывоз";	
	Иначе 
		ПечСпособДоставки = СокрЛП(ГрузополучательПечать.МаршрутДоставки); 
	КонецЕсли; 
	
	ОбластьМакета.Параметры.МаршрутДоставки = ПечСпособДоставки; 
	
	ОбластьМакета.Параметры.Код  = СтрЗаменить(Строка(ГрузополучательПечать.Код), Символы.НПП, ""); 
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДокументШтрихКода); 
	
	ТабличныйДокумент.Вывести(ОбластьМакета);        
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Сч = 0;
	
	Для каждого Стр Из Объединение.ТранспортныеЕдиницы Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ГрузовоеМесто) Тогда
			Продолжить;	
		КонецЕсли;     
		
		Сч = Сч + 1;
		
		ОбластьМакета.Параметры.Сч = Сч;
		ОбластьМакета.Параметры.ГрузовоеМесто = "ГМ" + Стр.ГрузовоеМесто.Номер;
		ОбластьМакета.Параметры.КодГрузовогоМеста = Документы.ГрузовоеМесто.ПолучитьШтрихкодГрузоместа(Стр.ГрузовоеМесто);  
		ОбластьМакета.Параметры.Назначение = Стр.ГрузовоеМесто.Сборка.Назначение;
		
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	Если Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
		
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.ШтрихМеста);
		ТабличныйДокумент.Вывести(ОбластьМакета);      
		
	Иначе  
			
		ОбластьМакета.Рисунки.ШтрихМеста.Картинка = ШтрихкодированиеПечатныхФорм.ПолучитьКартинкуШКДляРисунка(ОбластьМакета.Рисунки.ШтрихМеста, "1234567890128", 1, Истина);
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакетаДопСтрока = Макет.ПолучитьОбласть("ПодвалДоставка");
		ТабличныйДокумент.Вывести(ОбластьМакетаДопСтрока);    
		
	КонецЕсли; 

	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 		
	
	ТабличныйДокумент.ПолеСверху = 0.1;
	ТабличныйДокумент.ПолеСлева = 1;
	ТабличныйДокумент.ПолеСнизу = 0.1;
	ТабличныйДокумент.ПолеСправа = 1;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПринтера = Принтер;
	
	Если СразуНаПринтер Тогда
		ТабличныйДокумент.Напечатать(); 
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьШтрихкодОбъединение(Объединение) Экспорт
	
	Возврат Формат(Объединение.ДатаШтрихкода, "ДФ=ddMMyyyyЧЧммсс") + "1" + Формат(Число(Объединение.Номер), "ЧЦ=10; ЧВН=; ЧГ=0"); 									
		
КонецФункции

Функция ПолучитьМассивСборокПоОбъединению(Объединение) Экспорт
	
	МассивОбъединений = Новый Массив;
	
	Если ТипЗнч(Объединение) = Тип("ДокументСсылка.ОбъединениеГМВТЕ") Тогда
		МассивОбъединений.Добавить(Объединение);
	Иначе
		МассивОбъединений = Объединение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка КАК Сборка
	|ИЗ
	|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
	|ГДЕ
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В (&МассивОбъединений)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка";
	
	Запрос.УстановитьПараметр("МассивОбъединений", МассивОбъединений);  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сборка");
	
КонецФункции 

Функция ПолучитьМассивСборокПоЗаданиюНаДоставку(ЗаданиеНаДоставку) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Объединение
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
	|	И ЗаданиеНаДоставкуДоставка.ДокументСборки ССЫЛКА Документ.ОбъединениеГМВТЕ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаДоставку);  
	
	МассивОбъединений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объединение");
	
	Возврат Документы.ОбъединениеГМВТЕ.ПолучитьМассивСборокПоОбъединению(МассивОбъединений);	
	
КонецФункции
